
        document.querySelectorAll('.group-link').forEach(link => {
            link.addEventListener('click', function(e) {
                e.preventDefault();
                const scheduleId = this.getAttribute('href');
                const scheduleContent = document.getElementById('schedule-content');
                
                const schedules ={
                    '#group1-mon': `
                        <h2>Расписание группы ВЕБ1-23 на понедельник</h2>
                        <table class="schedule-table">
                            <thead>
                                <tr>
                                    <th>Время</th>
                                    <th>Предмет</th>
                                    <th>Преподаватель</th>
                                    <th>Аудитория</th>
                                </tr>
                            </thead>
                            <tbody>
                                <tr>
                                    <td>-</td>
                                    <td>-</td>
                                    <td>-</td>
                                    <td>-</td>
                                </tr>
                                <tr>
                                    <td>10:40 - 12:10</td>
                                    <td>Операционные системы и среды</td>
                                    <td>Чернецкий С.Р.</td>
                                    <td>к403</td>
                                </tr>
                                <tr>
                                    <td>13:00 - 14:30</td>
                                    <td>Теория вероятностей и математическая статистика</td>
                                    <td>Баранов О.В.</td>
                                    <td>к418</td>
                                </tr>
                                <tr>
                                    <td>14:40 - 16:10</td>
                                    <td>Информационные технологии</td>
                                    <td>Волкова Ю.А.</td>
                                    <td>к312б</td>
                                </tr>
                                    <tr>
                                    <td>16:20 - 17:50</td>
                                    <td>Проектирование и разработка интерфейсов пользователя</td>
                                    <td>Христосова Н.Г.</td>
                                    <td>к206б</td>
                                </tr>
                            </tbody>
                        </table>
                    `,
                    '#group2-mon': `
                        <h2>Расписание группы ВЕБ2-23 на понедельник</h2>
                        <table class="schedule-table">
                            <thead>
                                <tr>
                                    <th>Время</th>
                                    <th>Предмет</th>
                                    <th>Преподаватель</th>
                                    <th>Аудитория</th>
                                </tr>
                            </thead>
                            <tbody>
                                <tr>
                                    <td>09:00 - 10:30</td>
                                    <td>Основы алгоритмизации и программирования</td>
                                    <td>Рябушенко Е.В.</td>
                                    <td>к405</td>
                                </tr>
                                <tr>
                                    <td>10:40 - 12:10</td>
                                    <td>Операционные системы и среды</td>
                                    <td>Мустафаева Е.Ю.</td>
                                    <td>к313б</td>
                                </tr>
                                <tr>
                                    <td>13:00 - 14:30</td>
                                    <td>Проектироваие и разработка интерфейсов пользователя</td>
                                    <td>Брускова Э.В.</td>
                                    <td>к313б/td>
                                </tr>
                                <tr>
                                    <td>14:40 - 16:10</td>
                                    <td>Основы алгоритмизации и программирования</td>
                                    <td>Рябушенко Е.В</td>
                                    <td>к405</td>
                                </tr>
                            </tbody>
                        </table>
                    `,

            
                    '#group3-tue': `Расписание ВЕБ1-23 на Вторник: 
                        <h2>Расписание группы ВЕБ1-23 на Вторник</h2>
                        <table class="schedule-table">
                            <thead>
                                <tr>
                                    <th>Время</th>
                                    <th>Предмет</th>
                                    <th>Преподаватель</th>
                                    <th>Аудитория</th>
                                </tr>
                            </thead>
                            <tbody>
                                <tr>
                                    <td>9:00-10:30</td>
                                    <td>Проектирование и разработка интерфейсов пользователя</td>
                                    <td>Христосова Н.Г.</td>
                                    <td>к301/1</td>
                                </tr>
                                <tr>
                                    <td>10:40 - 12:10</td>
                                    <td>Проектирование и разработка интерфейсов пользователя</td>
                                    <td>Христосова Н.Г.</td>
                                    <td>к301/1</td>
                                </tr>
                                <tr>
                                    <td>13:00 - 14:30</td>
                                    <td>Элементы высшей математики</td>
                                    <td>Эшанов А.А.</td>
                                    <td>к418</td>
                                </tr>
                                <tr>
                                    <td>14:40 - 16:10</td>
                                    <td>Основы алгоритмизации и программирования</td>
                                    <td>Чернецкий С.Р.</td>
                                    <td>к403</td>
                                </tr>
                                    <tr>
                                    <td>16:20 - 17:50</td>
                                    <td>-</td>
                                    <td>-</td>
                                    <td>-</td>
                                </tr>
                            </tbody>
                        </table>
                    `,
                    '#group4-tue': `Расписание ВЕБ2-23 на Вторник: 
                    <h2>Расписание группы ВЕБ2-23 на Вторник</h2>
                        <table class="schedule-table">
                            <thead>
                                <tr>
                                    <th>Время</th>
                                    <th>Предмет</th>
                                    <th>Преподаватель</th>
                                    <th>Аудитория</th>
                                </tr>
                            </thead>
                            <tbody>
                                <tr>
                                    <td>09:00 - 10:30</td>
                                    <td>Проектрирование и разработка интерфейсов пользователя</td>
                                    <td>Брускова Э.В.</td>
                                    <td>к209</td>
                                </tr>
                                <tr>
                                    <td>10:40 - 12:10</td>
                                    <td>Графический дизайн и мультимедиа</td>
                                    <td>Христосова Н.Г.</td>
                                    <td>209</td>
                                </tr>
                                <tr>
                                    <td>13:00 - 14:30</td>
                                    <td>Психология общения</td>
                                    <td>Белоусова С.А.</td>
                                    <td>к313б/td>
                                </tr>
                                <tr>
                                    <td>14:40 - 16:10</td>
                                    <td>Основы алгоритмизации и программирования</td>
                                    <td>Рябушенко Е.В</td>
                                    <td>к405</td>
                                </tr>
                            </tbody>
                        </table>
                        `,


                    '#group5-wed': `Расписание ВЕБ1-23 на Среда: 
                     <h2>Расписание группы ВЕБ1-23 на среду</h2>
                        <table class="schedule-table">
                            <thead>
                                <tr>
                                    <th>Время</th>
                                    <th>Предмет</th>
                                    <th>Преподаватель</th>
                                    <th>Аудитория</th>
                                </tr>
                            </thead>
                            <tbody>
                                <tr>
                                    <td>9:00-10:30</td>
                                    <td>Графический дизайн и мультимедиа</td>
                                    <td>Христосова Н.Г.</td>
                                    <td>к405</td>
                                </tr
                                <tr>
                                    <td>10:40 - 12:10</td>
                                    <td>Графический дизайн и мультимедиа</td>
                                    <td>Христосова Н.Г.</td>
                                    <td>к405</td>
                                </tr>
                                <tr>
                                    <td>13:00 - 14:30</td>
                                    <td>Психология общения</td>
                                    <td>Белоусова С.А.</td>
                                    <td>к420</td>
                                </tr>
                                <tr>
                                    <td>14:40 - 16:10</td>
                                    <td>-</td>
                                    <td>-</td>
                                    <td>-</td>
                                </tr>
                                    <tr>
                                    <td>16:20 - 17:50</td>
                                    <td>-</td>
                                    <td>-</td>
                                    <td>-</td>
                                </tr>
                            </tbody>
                        </table>
                    `,
                    '#group6-wed': `Расписание ВЕБ2-23 на Среда: 
                    <h2>Расписание группы ВЕБ2-23 на Среду</h2>
                        <table class="schedule-table">
                            <thead>
                                <tr>
                                    <th>Время</th>
                                    <th>Предмет</th>
                                    <th>Преподаватель</th>
                                    <th>Аудитория</th>
                                </tr>
                            </thead>
                            <tbody>
                                <tr>
                                    <td>09:00 - 10:30</td>
                                    <td>-</td>
                                    <td>-</td>
                                    <td>-</td>
                                </tr>
                                <tr>
                                    <td>10:40 - 12:10</td>
                                    <td>Иностранный язык в профессиональной деятельности</td>
                                    <td>Фомичева В.Ю.</td>
                                    <td>к205б</td>
                                </tr>
                                <tr>
                                    <td>13:00 - 14:30</td>
                                    <td>Графический дизайн и мультимедиа</td>
                                    <td>Христосова Н.Г.</td>
                                    <td>к203</td>
                                </tr>
                                <tr>
                                    <td>14:40 - 16:10</td>
                                    <td>Графический дизайн и мультимедиа</td>
                                    <td>Христосова Н.Г.</td>
                                    <td>к203</td>
                                </tr>
                                <tr>
                                    <td>16:20- 17:50</td>
                                    <td>Физическая культура</td>
                                    <td>Усик О.И</td>
                                    <td>Спортзал ККМТ</td>
                                </tr>
                            </tbody>
                        </table>
                        `,


                    '#group7-Thus': `Расписание ВЕБ1-23 на Четверг:
                    <h2>Расписание группы ВЕБ1-23 на Четверг</h2>
                        <table class="schedule-table">
                            <thead>
                                <tr>
                                    <th>Время</th>
                                    <th>Предмет</th>
                                    <th>Преподаватель</th>
                                    <th>Аудитория</th>
                                </tr>
                            </thead>
                            <tbody>
                                <tr>
                                    <td>9:00-10:30</td>
                                    <td>Физичесая культура</td>
                                    <td>Болдин Р.И.</td>
                                    <td>к405</td>  
                                </tr
                                <tr>
                                    <td>10:40 - 12:10</td>
                                    <td>Графический дизайн и мультимедиа</td>
                                    <td>Христосова Н.Г.</td>
                                    <td>к405</td>
                                </tr>
                                <tr>
                                    <td>13:00 - 14:30</td>
                                    <td>Психология общения</td>
                                    <td>Белоусова С.А.</td>
                                    <td>к420</td>
                                </tr>
                                <tr>
                                    <td>14:40 - 16:10</td>
                                    <td>-</td>
                                    <td>-</td>
                                    <td>-</td>
                                </tr>
                                    <tr>
                                    <td>16:20 - 17:50</td>
                                    <td>-</td>
                                    <td>-</td>
                                    <td>-</td>
                                </tr>
                            </tbody>
                        </table>
                    `,
                    '#group8-Thus': `Расписание ВЕБ2-23 на Четверг: 
                    <h2>Расписание группы ВЕБ2-23 на Четверг</h2>
                        <table class="schedule-table">
                            <thead>
                                <tr>
                                    <th>Время</th>
                                    <th>Предмет</th>
                                    <th>Преподаватель</th>
                                    <th>Аудитория</th>
                                </tr>
                            </thead>
                            <tbody>
                                <tr>
                                    <td>09:00 - 10:30</td>
                                    <td>Элементы высшей математики</td>
                                    <td>Эшанов А.А.</td>
                                    <td>к311б</td>
                                </tr>
                                <tr>
                                    <td>10:40 - 12:10</td>
                                    <td>Проектирование и разработка интерфейсов пользователя</td>
                                    <td>Брускова Э.В.</td>
                                    <td>к209</td>
                                </tr>
                                <tr>
                                    <td>13:00 - 14:30</td>
                                   <td>Проектирование и разработка интерфейсов пользователя</td>
                                    <td>Брускова Э.В.</td>
                                    <td>к209</td>
                                </tr>
                                <tr>
                                    <td>14:40 - 16:10</td>
                                    <td>Проектирование и разработка интерфейсов пользователя</td>
                                    <td>Брускова Э.В.</td>
                                    <td>к209</td>
                                </tr>
                                <tr>
                                    <td>16:20- 17:50</td>
                                    <td>-</td>
                                    <td>-</td>
                                    <td>-</td>
                                </tr>
                            </tbody>
                        </table>
                        `,


                    '#group9-fr': `Расписание ВЕБ1-23 на Пятница:
                        <table class="schedule-table">
                            <thead>
                                <tr>
                                    <th>Время</th>
                                    <th>Предмет</th>
                                    <th>Преподаватель</th>
                                    <th>Аудитория</th>
                                </tr>
                            </thead>
                            <tbody>
                                <tr>
                                    <td>9:00-10:30</td>
                                    <td>Проектирование и разработка интерфейсов пользователя</td>
                                    <td>Христосова Н.Г.</td>
                                    <td>к301/1</td>
                                </tr>
                                <tr>
                                    <td>10:40 - 12:10</td>
                                    td>Проектирование и разработка интерфейсов пользователя</td>
                                    <td>Христосова Н.Г.</td>
                                    <td>к301/1</td>
                                </tr>
                                <tr>
                                    <td>13:00 - 14:30</td>
                                    <td>Элементы высшей математики</td>
                                    <td>Эшанов А.А.</td>
                                    <td>к418</td>
                                </tr>
                                <tr>
                                    <td>14:40 - 16:10</td>
                                    <td>Основы алгоритмизации и программирования</td>
                                    <td>Чернецкий С.Р.</td>
                                    <td>к403</td>
                                </tr>
                                    <tr>
                                    <td>16:20 - 17:50</td>
                                    <td>-</td>
                                    <td>-</td>
                                    <td>-</td>
                                </tr>
                            </tbody>
                        </table>
                    `,
                    '#group10-fr': `Расписание ВЕБ2-23 на Пятница: 
                    <h2>Расписание группы ВЕБ2-23 на Пятницу</h2>
                        <table class="schedule-table">
                            <thead>
                                <tr>
                                    <th>Время</th>
                                    <th>Предмет</th>
                                    <th>Преподаватель</th>
                                    <th>Аудитория</th>
                                </tr>
                            </thead>
                            <tbody>
                                <tr>
                                    <td>09:00 - 10:30</td>
                                    <td>Теория вероятностей и математическая статистика</td>
                                    <td>Баранов О.В.</td>
                                    <td>к313</td>
                                </tr>
                                <tr>
                                    <td>10:40 - 12:10</td>
                                    <td>Информационные технологии</td>
                                    <td>Волкова Ю.А.</td>
                                    <td>к312б</td>
                                </tr>
                                <tr>
                                    <td>13:00 - 14:30</td>
                                    <td>-</td>
                                    <td>-</td>
                                    <td>-</td>
                                </tr>
                                <tr>
                                    <td>14:40 - 16:10</td>
                                    <td>-</td>
                                    <td>-</td>
                                    <td>-</td>
                                </tr>
                                <tr>
                                    <td>16:20- 17:50</td>
                                    <td>-</td>
                                    <td>-</td>
                                    <td>-</td>
                                </tr>
                            </tbody>
                        </table>
                        `,
                };

                scheduleContent.innerHTML = schedules[scheduleId] || 'Расписание не найдено';
            });
        });